/* 메뉴 항목 및 창 제목 */
"NINE_BOX_VIEW" = "나인박스뷰 Pro";

/* 참조 글리프 섹션 */
"REFERENCE_INPUT_PLACEHOLDER" = "참조 글리프 입력…";
"SAVE_REFERENCE_BUTTON" = "저장";
"SAVE_REFERENCE_TOOLTIP" = "참조 프리셋에 저장";

/* 테마 토글 버튼 */
"THEME_TOGGLE_LIGHT_TOOLTIP" = "다크 모드로 전환";
"THEME_TOGGLE_DARK_TOOLTIP" = "라이트 모드로 전환";

/* 참조 패널 토글 버튼 */
"REFERENCE_PANEL_SHOW_TOOLTIP" = "참조 패널 표시";
"REFERENCE_PANEL_HIDE_TOOLTIP" = "참조 패널 숨기기";

/* 참조 창 제목 */
"REFERENCE_PANEL_TITLE" = "참조";

/* 잠금 창 제목 */
"LOCKED_PANEL_TITLE" = "잠금";

/* 프리셋 패널 토글 버튼 */
"PRESETS_TOGGLE_SHOW_TOOLTIP" = "프리셋 패널 표시";
"PRESETS_TOGGLE_HIDE_TOOLTIP" = "프리셋 패널 숨기기";

/* 프리셋 창 제목 */
"PRESETS_WINDOW_TITLE" = "프리셋";

/* 블러 슬라이더 */
"BLUR_SLIDER_TOOLTIP" = "블러 강도";

/* 글리프 피커 */
"GLYPH_PICKER_TITLE_LOCK" = "잠금 글리프 선택";
"GLYPH_PICKER_TITLE_REFERENCE" = "참조 글리프 선택";

/* 컨텍스트 메뉴 (참조 텍스트 뷰) */
"CONTEXT_MENU_GLYPH_PICKER" = "글리프 피커…";

/* 제목 표시줄 메뉴 버튼 */
"TITLEBAR_MENU_TOOLTIP" = "메뉴";

/* 정보 메뉴 */
"INFO_MENU_HELP" = "사용 설명서";
"INFO_MENU_WEBSITE" = "공식 웹사이트";
"INFO_MENU_FEEDBACK" = "피드백…";
"INFO_MENU_CONTACT_US" = "문의하기…";
"INFO_MENU_TESTIMONIAL" = "사용 후기 공유…";
"INFO_MENU_PURCHASE" = "구매…";

/* 잠금 토글 버튼 (메인 창 도구 모음) */
"LOCK_TOGGLE_ENABLED_TOOLTIP" = "잠금 글리프 표시 중 (Cmd로 편집)";
"LOCK_TOGGLE_DISABLED_TOOLTIP" = "잠금 글리프 숨김 (Cmd로 편집)";

/* 잠금 글리프 패널 */
"CLEAR_LOCKED_BUTTON" = "지우기";
"CLEAR_LOCKED_TOOLTIP" = "모든 잠금 지우기";
"SAVE_LOCKED_BUTTON" = "저장";
"SAVE_LOCKED_TOOLTIP" = "잠금 프리셋에 저장";
"LOCKED_PANEL_TOGGLE_SHOW" = "잠금 패널 표시";
"LOCKED_PANEL_TOGGLE_HIDE" = "잠금 패널 숨기기";

/* 참조 글리프 입력 대화상자 */
"REFERENCE_INPUT_CANCEL" = "취소";

/* 드래그 힌트 */
"Open Grid in New Tab" = "새 탭에서 그리드 열기";

/* 도구 모음 토글 버튼 */
"TOOLBAR_TOGGLE_HIDE_TOOLTIP" = "도구 모음 숨기기";
"TOOLBAR_TOGGLE_SHOW_TOOLTIP" = "도구 모음 표시";

/* 라이선스 상태 */
"LICENSE_TRIAL_REMAINING" = "체험 기간: %ld일 남음";
"LICENSE_TRIAL_DAYS" = "%ld일 남음";
"LICENSE_ACTIVATED" = "라이선스 소유자: %@";

/* 라이선스 입력 대화상자 */
"LICENSE_INPUT_TITLE" = "라이선스 활성화";
"LICENSE_INPUT_CANCEL" = "취소";
"LICENSE_INPUT_BUY" = "구매…";
"LICENSE_INPUT_CONTACT" = "고객 지원";

/* 라이선스 드롭 영역 */
"LICENSE_DROP_HINT" = ".license 파일을 여기에 놓으세요";
"LICENSE_DROP_ACTIVE" = "놓으면 활성화됩니다";

/* 라이선스 오류 메시지 */
"LICENSE_ERROR_INVALID_KEY" = "라이선스 키가 유효하지 않습니다.";
"LICENSE_ERROR_INVALID_EMAIL" = "이메일 주소가 유효하지 않습니다.";
"LICENSE_ERROR_INVALID_FILE" = "유효하지 않은 라이선스 파일입니다.";
"LICENSE_ERROR_WRONG_PRODUCT" = "이 라이선스는 NineBoxView용이 아닙니다.";
"LICENSE_ERROR_MISSING_FIELDS" = "라이선스 파일이 불완전합니다.";
"LICENSE_ERROR_REVOKED" = "이 라이선스 키가 취소되었습니다.";
"LICENSE_VERIFYING" = "라이선스 확인 중...";

/* 라이선스 활성화 성공 */
"LICENSE_ACTIVATION_SUCCESS_TITLE" = "라이선스 활성화 완료";
"LICENSE_ACTIVATION_SUCCESS_OK" = "확인";

/* 체험 기간 만료 화면 */
"LICENSE_EXPIRED_WINDOW_TITLE" = "나인박스뷰 Pro";
"LICENSE_EXPIRED_TITLE" = "체험 기간이 종료되었습니다";
"LICENSE_EXPIRED_MESSAGE" = "14일 체험 기간이 종료되었습니다.\n나인박스뷰 Pro를 계속 사용하려면 라이선스를 구매해 주세요.";
"LICENSE_EXPIRED_PURCHASE" = "라이선스 구매";
"LICENSE_EXPIRED_ENTER_KEY" = "라이선스 키 입력";
"LICENSE_EXPIRED_FREE_VERSION" = "무료 버전 사용";

/* 정보 메뉴 */
"INFO_MENU_ENTER_LICENSE" = "라이선스 입력…";

/* 환영 대화상자 */
"LICENSE_WELCOME_TITLE" = "나인박스뷰 Pro에 오신 것을 환영합니다";
"LICENSE_WELCOME_MESSAGE" = "강력한 9칸 미리보기 기능을 체험하여 더 나은 글리프 디자인 결정을 내리세요.\n\n아래 버튼을 클릭하면 14일 무료 체험이 시작됩니다.";
"LICENSE_WELCOME_START_TRIAL" = "14일 체험 시작";
"LICENSE_WELCOME_ENTER_KEY" = "라이선스 키 입력";

/* 팔레트 탭 */
"PALETTE_TAB_REFERENCE" = "참조";
"PALETTE_TAB_LOCKED" = "잠금";

/* 팔레트 컨텍스트 메뉴 */
"PALETTE_MENU_PIN" = "고정";
"PALETTE_MENU_UNPIN" = "고정 해제";
"PALETTE_MENU_RENAME" = "이름 변경…";
"PALETTE_MENU_OVERWRITE" = "현재 내용으로 대체";
"PALETTE_MENU_DELETE" = "삭제";

/* 팔레트 컨텍스트 메뉴 - 다중 선택 */
"PALETTE_MENU_DELETE_MULTIPLE" = "%lu개 항목 삭제";
"PALETTE_MENU_PIN_MULTIPLE" = "%lu개 항목 고정";
"PALETTE_MENU_UNPIN_MULTIPLE" = "%lu개 항목 고정 해제";

/* 팔레트 빈 상태 */
"PALETTE_EMPTY_REFERENCE" = "참조 프리셋 없음\n+ 로 추가";
"PALETTE_EMPTY_LOCKED" = "잠금 프리셋 없음\n+ 로 추가";

/* 팔레트 덮어쓰기 확인 */
"PALETTE_OVERWRITE_CONFIRM_TITLE" = "덮어쓰기 확인";
"PALETTE_OVERWRITE_CONFIRM_MESSAGE" = "프리셋 내용이 대체됩니다. 이 작업은 되돌릴 수 없습니다.";
"PALETTE_OVERWRITE_CONFIRM_OK" = "덮어쓰기";

/* 그리드 뷰 컨텍스트 메뉴 */
"CONTEXT_MENU_SHOW_REFERENCE_INPUT" = "참조 패널 표시";
"CONTEXT_MENU_HIDE_REFERENCE_INPUT" = "참조 패널 숨기기";
"CONTEXT_MENU_SHOW_LOCKED_PANEL" = "잠금 패널 표시";
"CONTEXT_MENU_HIDE_LOCKED_PANEL" = "잠금 패널 숨기기";
"CONTEXT_MENU_SHOW_PRESETS" = "프리셋 패널 표시";
"CONTEXT_MENU_HIDE_PRESETS" = "프리셋 패널 숨기기";
"CONTEXT_MENU_SHOW_TOOLBAR" = "도구 모음 표시";
"CONTEXT_MENU_HIDE_TOOLBAR" = "도구 모음 숨기기";
"CONTEXT_MENU_LIGHT_MODE" = "라이트 모드";
"CONTEXT_MENU_DARK_MODE" = "다크 모드";
/* 그리드 (Issue #422) */
"CONTEXT_MENU_SHOW_GRID_LINES" = "그리드 표시";
"CONTEXT_MENU_HIDE_GRID_LINES" = "그리드 숨기기";
"CONTEXT_MENU_GRID_STYLE" = "그리드 스타일";
"GRID_STYLE_FIELD" = "십자격자";
"GRID_STYLE_ASTERISK" = "대각선격자";
"GRID_STYLE_HASH" = "삼분할격자";
/* 그리드 도구 모음 버튼 (Option+클릭: 설정) */
"GRID_TOGGLE_SHOW_TOOLTIP" = "격자 표시 (Option: 설정)";
"GRID_TOGGLE_HIDE_TOOLTIP" = "격자 숨기기 (Option: 설정)";
/* 자면틀 (Issue #435) */
"CONTEXT_MENU_SHOW_COUNTER_FRAME" = "자면틀 표시";
"CONTEXT_MENU_HIDE_COUNTER_FRAME" = "자면틀 숨기기";
"CONTEXT_MENU_GRID_SETTINGS" = "그리드 설정…";
"GRID_STYLE_LABEL" = "스타일";
"COUNTER_FRAME_LABEL" = "자면틀";

/* 그리드 뷰 컨텍스트 메뉴 - 글리프 작업 */
"CONTEXT_MENU_INSERT_AT_CURSOR" = "커서 위치에 삽입";
"CONTEXT_MENU_OPEN_IN_NEW_TAB" = "새 탭에서 열기";

/* 가져오기/내보내기 메뉴 */
"PRESETS_MENU_IMPORT" = "가져오기…";
"PRESETS_MENU_EXPORT_SELECTED" = "선택 항목 내보내기…";
"PRESETS_MENU_EXPORT_ALL" = "모두 내보내기…";

/* 가져오기 모드 대화상자 */
"PRESETS_IMPORT_MODE_TITLE" = "프리셋 가져오기";
"PRESETS_IMPORT_MODE_MESSAGE" = "%lu개의 프리셋을 찾았습니다. 어떻게 가져올까요?";
"PRESETS_IMPORT_MODE_APPEND" = "추가";
"PRESETS_IMPORT_MODE_REPLACE" = "모두 대체";

/* 가져오기 오류 */
"PRESETS_IMPORT_ERROR_TITLE" = "가져오기 실패";
"PRESETS_IMPORT_ERROR_INVALID_FORMAT" = "파일 형식이 올바르지 않습니다.";
"PRESETS_IMPORT_ERROR_UNSUPPORTED_VERSION" = "이 파일은 새 버전에서 만들어졌습니다. 플러그인을 업데이트하세요.";
"PRESETS_IMPORT_ERROR_TYPE_MISMATCH" = "이 파일에는 %@ 프리셋이 있지만, 현재 %@ 탭에 있습니다.";
"PRESETS_IMPORT_ERROR_EMPTY" = "이 파일에 유효한 프리셋이 없습니다.";

/* 내보내기 오류 */
"PRESETS_EXPORT_ERROR_TITLE" = "내보내기 실패";
"PRESETS_EXPORT_ERROR_MESSAGE" = "파일을 저장할 수 없습니다: %@";

/* 유형 이름 */
"PRESETS_TYPE_REFERENCE" = "참조";
"PRESETS_TYPE_LOCKED" = "잠금";

/* 검색 필드 placeholder */
"SEARCH_PRESETS_PLACEHOLDER" = "프리셋 검색…";
"SEARCH_NO_RESULTS" = "결과 없음";

/* 정렬 옵션 */
"SORT_NAME_AZ" = "이름 A → Z";
"SORT_NAME_ZA" = "이름 Z → A";
"SORT_DATE_NEWEST" = "추가 날짜 (최신순)";
"SORT_DATE_OLDEST" = "추가 날짜 (오래된순)";

/* 정렬 버튼 툴팁 */
"SORT_BUTTON_TOOLTIP" = "정렬";

/* 정보 패널 */
"ABOUT_MENU_ITEM" = "나인박스뷰 Pro에 대하여…";
"ABOUT_WINDOW_TITLE" = "정보";
"ABOUT_LICENSED_TO" = "라이선스 소유자:";
"ABOUT_LINK_WEBSITE" = "공식 웹사이트";
"ABOUT_LINK_HELP" = "사용 설명서";
"ABOUT_TRIAL_STATUS" = "체험 중";
"ABOUT_TRIAL_EXPIRED" = "체험 기간 만료";
"ABOUT_STATUS_LICENSED" = "라이선스 인증됨";
"ABOUT_STATUS_UNLICENSED" = "미인증";

/* 라이선스 해제 */
"ABOUT_DEACTIVATE_LICENSE" = "라이선스 해제";
"ABOUT_DEACTIVATE_CONFIRM_TITLE" = "라이선스를 해제하시겠습니까?";
"ABOUT_DEACTIVATE_CONFIRM_MESSAGE" = "이 컴퓨터에서 라이선스 정보가 삭제됩니다. 라이선스 키로 언제든지 다시 인증할 수 있습니다.";
"ABOUT_DEACTIVATE_CONFIRM_OK" = "해제";
"ABOUT_DEACTIVATE_CONFIRM_CANCEL" = "취소";
